def task1():
    """
    Дан список A размера N (N — четное число). Вывести его элементы с четными
    номерами в порядке возрастания номеров: A2, A4, A6, ..., AN. 
    Условный оператор не использовать.
    """
    # Пример списка (можно заменить на ввод пользователя)
    A = [10, 20, 30, 40, 50, 60, 70, 80]
    N = len(A)
    
    # Получаем элементы с четными индексами (помним, что индексация с 0)
    # Используем срез с шагом 2, начиная с индекса 1 (что соответствует A2)
    even_elements = A[1::2]
    
    # Выводим результат
    print("Элементы с четными номерами:")
    for element in even_elements:
        print(element, end=' ')
    print()

# Вызов функции для задачи 1
task1()
